app/views/characters/_form.html.erb

    <%= f.label :universe %><br>
    <%= collection_select(:character, :universe_id, Universe.all, :id, :name, include_blank: true) %>
---
SELECT "universes".* FROM "universes"


    <%= collection_check_boxes(:character, :ability_ids, Ability.all, :id, :name) %>
---
SELECT "abilities".* FROM "abilities"