app/controllers/abilities_controller.rb

  def index
    @abilities = Ability.all
---
SELECT "abilities".* FROM "abilities"

  def create
    @ability = Ability.new(abilities_params)

    if @ability.save
---
INSERT INTO "abilities" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Martial Arts"], ["created_at", "2016-03-16 22:28:17.129553"], ["updated_at", "2016-03-16 22:28:17.129553"]]

  def update
    if @ability.update(abilities_params)
---
UPDATE "abilities" SET "name" = ?, "updated_at" = ? WHERE "abilities"."id" = ?  [["name", "power"], ["updated_at", "2016-03-16 22:26:58.591627"], ["id", 1]]

  def destroy
    @ability.destroy
---
DELETE FROM "abilities" WHERE "abilities"."id" = ?  [["id", 4]]

  def find_ability
    @ability = Ability.find(params[:id])
---
SELECT  "abilities".* FROM "abilities" WHERE "abilities"."id" = ? LIMIT 1  [["id", 4]]