app/controllers/characters_controller.rb

INSERT INTO "characters" ("first_name", "last_name", "hero_name", "universe_id", "bio", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @character = Character.new(character_params)

    if @character.save

SELECT  "characters".* FROM "characters" WHERE "characters"."id" = ? LIMIT 1  [["id", 1]]
---
  def edit
    @character = Character.find(params[:id])

SELECT  "characters".* FROM "characters" WHERE "characters"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "characters" SET "hero_name" = ?, "updated_at" = ? WHERE "characters"."id" = ?  [["hero_name", "The Incredible Hulk"], ["updated_at", "2016-03-10 01:34:53.614835"], ["id", 5]]
---
  def update
    @character = Character.find(params[:id])

    if @character.update(character_params)