app/controllers/universes_controller.rb

  def index
    @universes = Universe.all
---
SELECT "universes".* FROM "universes"

  def show
    @universe = Universe.find(params[:id])
---
SELECT  "universes".* FROM "universes" WHERE "universes"."id" = ? LIMIT 1  [["id", 3]]

  def create
    @universe = Universe.new(universe_params)

    if @universe.save
---
INSERT INTO "universes" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Veritigo"], ["created_at", "2016-03-16 22:31:57.261665"], ["updated_at", "2016-03-16 22:31:57.261665"]]

  def edit
    @universe = Universe.find(params[:id])
---
SELECT  "universes".* FROM "universes" WHERE "universes"."id" = ? LIMIT 1  [["id", 3]]

  def update
    @universe = Universe.find(params[:id])

    if @universe.update(universe_params)
---
SELECT  "universes".* FROM "universes" WHERE "universes"."id" = ? LIMIT 1  [["id", 3]]
UPDATE "universes" SET "name" = ?, "updated_at" = ? WHERE "universes"."id" = ?  [["name", "Veritiga"], ["updated_at", "2016-03-16 22:32:03.430970"], ["id", 3]]